import { useState } from 'react'
import ArticlesList from '../../components/ArticlesList'
import SelectedTopic from '../../components/SelectedTopic'
import Discuss from '../../components/Discuss'

/* Image */
import retro from '../../assets/images/image-retro-pcs.jpg'
import keyboard from '../../assets/images/image-top-laptops.jpg'
import growth from '../../assets/images/image-gaming-growth.jpg'
import imagePost from '../../assets/images/image-web-3-desktop.jpg'

// const posts = [
//     {
//         id: '1',
//         title: 'У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку',
//         desc: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні',
//         subtitle:
//             'Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.',
//         text:
//             'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n' +
//             '\n' +
//             'Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n' +
//             '\n' +
//             'Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n' +
//             '\n' +
//             'Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.',
//         date: {
//             time: '19:44',
//             date: '03-08-2023',
//         },
//     },
//     {
//         id: '2',
//         title: 'У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку',
//         desc: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні',
//         subtitle:
//             'Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.',
//         text:
//             'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n' +
//             '\n' +
//             'Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n' +
//             '\n' +
//             'Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n' +
//             '\n' +
//             'Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.',
//         date: {
//             time: '19:44',
//             date: '03-08-2023',
//         },
//     },
//     {
//         id: '3',
//         title: 'У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку',
//         desc: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні',
//         subtitle:
//             'Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.',
//         text:
//             'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n' +
//             '\n' +
//             'Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n' +
//             '\n' +
//             'Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n' +
//             '\n' +
//             'Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.',
//         date: {
//             time: '19:44',
//             date: '03-08-2023',
//         },
//     },
//     // {
//     //   id: '4',
//     //   title: 'У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку',
//     //   desc: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні',
//     //   subtitle: 'Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.',
//     //   text: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n' +
//     //       '\n' +
//     //       'Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n' +
//     //       '\n' +
//     //       'Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n' +
//     //       '\n' +
//     //       'Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.',
//     //   date: {
//     //     time: '19:44',
//     //     date: '03-08-2023'
//     //   }
//     // },
//     // {
//     //   id: '5',
//     //   title: 'У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку',
//     //   desc: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні',
//     //   subtitle: 'Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.',
//     //   text: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n' +
//     //       '\n' +
//     //       'Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n' +
//     //       '\n' +
//     //       'Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n' +
//     //       '\n' +
//     //       'Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.',
//     //   date: {
//     //     time: '19:44',
//     //     date: '03-08-2023'
//     //   }
//     // }
// ]

const cards = [
    {
        id: 1,
        title: 'Reviving Retro PCS',
        desc: 'What happers when old PCs are given modern upgrades?',
        img: retro,
    },
    {
        id: 2,
        title: 'Top 10 Laptops of 2023',
        desc: 'Our best picks for various needs and budgets.',
        img: keyboard,
    },
    {
        id: 3,
        title: 'The Growth of Gaming ',
        desc: 'How the pandemic has sparked fresh opportunities.',
        img: growth,
    },
]

const Home = () => {
    const [error, setError] = useState(null)
    const [activeTopic, setActiveTopic] = useState('For you')

    return (
        <div>
            <SelectedTopic
                activeTopic={activeTopic}
                setActiveTopic={setActiveTopic}
            />
            <div className="flex justify-between">
                <div className="blog w-7/12">
                    <ArticlesList activeTopic={activeTopic} />
                </div>
                <aside className="w-4/12">
                    <Discuss />
                </aside>
            </div>
        </div>
    )
}

export default Home
