import Sidebar from "../../components/Sidebar";
import imagePost from "../../assets/images/image-web-3-desktop.jpg";
import { Link } from "react-router-dom";

import retro from "../../assets/images/image-retro-pcs.jpg";
import keyboard from "../../assets/images/image-top-laptops.jpg";
import growth from "../../assets/images/image-gaming-growth.jpg";

const posts = [
  {
    id: "1",
    title:
      "У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку",
    desc: "Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні",
    subtitle:
      "Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.",
    text:
      "Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n" +
      "\n" +
      "Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n" +
      "\n" +
      "Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n" +
      "\n" +
      "Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.",
    date: {
      time: "19:44",
      date: "03-08-2023",
    },
  },
  {
    id: "2",
    title:
      "У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку",
    desc: "Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні",
    subtitle:
      "Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.",
    text:
      "Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n" +
      "\n" +
      "Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n" +
      "\n" +
      "Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n" +
      "\n" +
      "Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.",
    date: {
      time: "19:44",
      date: "03-08-2023",
    },
  },
  {
    id: "3",
    title:
      "У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку",
    desc: "Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні",
    subtitle:
      "Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.",
    text:
      "Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n" +
      "\n" +
      "Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n" +
      "\n" +
      "Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n" +
      "\n" +
      "Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.",
    date: {
      time: "19:44",
      date: "03-08-2023",
    },
  },
  // {
  //   id: '4',
  //   title: 'У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку',
  //   desc: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні',
  //   subtitle: 'Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.',
  //   text: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n' +
  //       '\n' +
  //       'Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n' +
  //       '\n' +
  //       'Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n' +
  //       '\n' +
  //       'Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.',
  //   date: {
  //     time: '19:44',
  //     date: '03-08-2023'
  //   }
  // },
  // {
  //   id: '5',
  //   title: 'У квітковій мінісукні і пальті з хутром: Лотті Мосс у красивому образі сходила на вечірку',
  //   desc: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні',
  //   subtitle: 'Модель і світська тусівниця стильним вбранням підкреслила струнку фігуру.',
  //   text: 'Лотті Мосс відвідала вечірку Blue Beetle DC, яка відбулася у Лондоні. Для такої події вона обрала корутку обтислу чорну сукню з квітковим принтом від бренду Guizio, яка ідеально підкреслила її струнку і сексуальну фігуру. Зверху Лотті одягла пальто з таким самим принтом і штучним хутром. Верхній одяг вона спустила нижче ліктів.\n' +
  //       '\n' +
  //       'Аутфіт модель доповнила чорними босоніжками і світло-блакитною сумкою із крокодилячої шкіри.\n' +
  //       '\n' +
  //       'Мосс зробила акуратну зачіску з локонами, ніжний макіяж із чорними стрілками і перламутровий манікюр.\n' +
  //       '\n' +
  //       'Нагадаємо, Лотті Мосс на вечірку з нагоди відкриття Radio 1 Big Weekend 2023 у готелі Londoner прийшла у рожевій сукні з глибоким вирізом на декольте та кількома вирізами на животі, яка була повністю розшита паєтками.',
  //   date: {
  //     time: '19:44',
  //     date: '03-08-2023'
  //   }
  // }
];

const cards = [
  {
    id: 1,
    title: "Reviving Retro PCS",
    desc: "What happers when old PCs are given modern upgrades?",
    img: retro,
  },
  {
    id: 2,
    title: "Top 10 Laptops of 2023",
    desc: "Our best picks for various needs and budgets.",
    img: keyboard,
  },
  {
    id: 3,
    title: "The Growth of Gaming ",
    desc: "How the pandemic has sparked fresh opportunities.",
    img: growth,
  },
];

const Home = () => {
  return (
    <>
      <div className="flex flex-col lg:flex-row w-full max-h-[480px]">
        {/* main post*/}

        <div className="relative w-full lg:mr-12 h-full">
          <div className="mb-10 w-100% h-[280px]">
            <Link to="/posts/id">
              <img
                className="h-full w-full object-cover"
                src={imagePost}
                alt="description"
              />
            </Link>
          </div>
          <div className="flex flex-row  justify-between w-full">
            <h1 className="text-5xl font-bold w-[45%]">
              The Bringht Future of Web 3.0?
            </h1>
            <div className="flex flex-col justify-between w-[50%]">
              <p>
                Lorem ipsum dolor sit amet, consectetur adipisicing elit.
                Accusamus aspernatur, consequatur distinctio doloremque eveniet
                ex explicabo!
              </p>
              <Link
                to="/posts/id"
                className="w-fit uppercase px-6 py-2 bg-red-500 text-white text-sm font-semibold tracking-widest cursor-pointer"
              >
                Read More
              </Link>
            </div>
          </div>
        </div>
        {/* sidebar */}
        <div>
          <Sidebar posts={posts} />
        </div>
      </div>
      {/* <div>
                <ul className='flex justify-between py-10'>
                    {cards.map((card) => {
                        return (
                            <li key={card.id} className='flex h-[200px] w-[30%]' >
                                <Link to={'/posts/id'}>
                                    <div className='flex'>
                                        <div className='w-[200px] h-[150px] mr-4'>
                                            <img className='w-full h-full object-cover' src={card.img} alt='image' />
                                        </div>
                                        <div>
                                            <div className='text-3xl text-gray-500 '>{`0` + card.id}</div>
                                            <h4 className='text-20px font-bold my-3'>{card.title}</h4>
                                            <p className='text-gray-500'>{card.desc}</p>
                                        </div>
                                    </div>
                                </Link>
                            </li>
                        );
                    })}
                </ul>
            </div> */}
    </>
  );
};

export default Home;
